israfilkhan-elecbits/smart_plug_1.2/sdkconfig.defaults
# smart_plug/sdkconfig.defaults
# ESP-IDF Target
CONFIG_IDF_TARGET="esp32"

# Serial config
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
CONFIG_ESPTOOLPY_BAUD=921600

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_ASSERT_ON_UNTESTED_FUNCTION=y
CONFIG_FREERTOS_TASK_FUNCTION_WRAPPER=y
CONFIG_FREERTOS_CHECK_STACKOVERFLOW=2

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=0
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_CSI_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=32
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_WIFI_RX_IRAM_OPT=y
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# LWIP
CONFIG_LWIP_LOCAL_HOSTNAME="smart-plug"
CONFIG_LWIP_DHCP_MAX_NTP_SERVERS=1
CONFIG_LWIP_DHCP_DOES_ARP_CHECK=n

# mbedTLS
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_MPI=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_TLS_ENABLED=y
CONFIG_MBEDTLS_PEM_CERTIFICATE=y
CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS=y

# SPI Flash
CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_ABORTS=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# Logging
CONFIG_LOG_DEFAULT_LEVEL_VERBOSE=y
CONFIG_LOG_MAXIMUM_LEVEL=5
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# Task Watchdog (disable for now)
CONFIG_ESP_TASK_WDT=n
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_TASK_WDT_PANIC=n

# Intr WDT
CONFIG_INT_WDT=n

# Power Management
CONFIG_PM_ENABLE=n

# Compiler optimizations - preserve floating point exactly
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT=n
CONFIG_COMPILER_DISABLE_GCC8_WARNINGS=y

# Floating point - preserve exact behavior
CONFIG_ESP32_FPGA=n
CONFIG_ESP32_FPU_SINGLE_PRECISION=y
CONFIG_ESP32_FORCE_SINGLE_PRECISION=n

# Main task stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Event loop
CONFIG_ESP_EVENT_LOOP_PROFILING=n
CONFIG_ESP_EVENT_POST_FROM_ISR=y

# HTTP
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_HTTPD_MAX_URI_LEN=256
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y
CONFIG_HTTPD_PURGE_BUF_LEN=32

# mDNS (optional, for discovery)
CONFIG_MDNS_ENABLE=y
CONFIG_MDNS_MAX_SERVICES=10